# 4, SQL _ Mathematical functions _ Delete, Sort rows
----
## OUTLINE:
- Sum of rows: SUM()
- Delete specified rows: DELETE FROM
- Sort rows: ORDER BY
- Average of rows: AVG()
- Filter out: WHERE + Nested statements
- Min and max values: MIN() MAX()

In [1]:
%load_ext sql
#the magic command to load the SQL extension

%sql sqlite:///testdatabase.db
#connect and create a db on your computer if it does not exist"

> Take a look at our table: Indian_all_2021

In [2]:
%%sql
SELECT * 
FROM Indian_all_2021

 * sqlite:///testdatabase.db
Done.

[(2021, 'Indians', 'All genders', '0 - 4 Years', 12296),
 (2021, 'Indians', 'All genders', '10 - 14 Years', 14964),
 (2021, 'Indians', 'All genders', '15 - 19 Years', 17096),
 (2021, 'Indians', 'All genders', '20 - 24 Years', 18891),
 (2021, 'Indians', 'All genders', '25 - 29 Years', 19448),
 (2021, 'Indians', 'All genders', '30 - 34 Years', 18580),
 (2021, 'Indians', 'All genders', '35 - 39 Years', 16778),
 (2021, 'Indians', 'All genders', '40 - 44 Years', 16133),
 (2021, 'Indians', 'All genders', '45 - 49 Years', 17818),
 (2021, 'Indians', 'All genders', '5 - 9 Years', 13175),
 (2021, 'Indians', 'All genders', '50 - 54 Years', 19290),
 (2021, 'Indians', 'All genders', '55 - 59 Years', 20736),
 (2021, 'Indians', 'All genders', '60 - 64 Years', 18867),
 (2021, 'Indians', 'All genders', '65 - 69 Years', 14059),
 (2021, 'Indians', 'All genders', '65 Years & Over', 34889),
 (2021, 'Indians', 'All genders', '70 - 74 Years', 10170),
 (2021, 'Indians', 'All genders', '70 Years & Over', 20830),
 (2021, 'Indians', 'All genders', '75 - 79 Years', 4211),
 (2021, 'Indians', 'All genders', '75 Years & Over', 10660),
 (2021, 'Indians', 'All genders', '80 - 84 Years', 3289),
 (2021, 'Indians', 'All genders', '80 Years & Over', 6449),
 (2021, 'Indians', 'All genders', '85 - 89 Years', 1905),
 (2021, 'Indians', 'All genders', '85 Years & Over', 3160),
 (2021, 'Indians', 'All genders', '90 Years & Over', 1255),
 (2021, 'Indians', 'All genders', 'All ages', 258961)]

### a. Check if the SUM of all genders of all ages equate the total value:

In [3]:
%%sql
SELECT VALUE AS the_stated_sum
FROM Indian_all_2021
WHERE AGE LIKE 'All%';

 * sqlite:///testdatabase.db
Done.

[(258961,)]

In [4]:
%%sql
SELECT SUM(VALUE) AS the_calculated_sum
FROM Indian_all_2021
WHERE AGE NOT LIKE 'All%';

 * sqlite:///testdatabase.db
Done.

[(334949,)]

>The calculated sum is way bigger than the stated sum within the table. Hence, we can conclude that the data is erroneous.

> However, as the data serves only for practice, let's stick to it for a while.
In this notebook, we will work on the table Indian_all_2021.

- Before moving on to the next step, let's delete all rows associated with the values: 'All genders', 'All ages' since they are of no use.

### b. Delete specified rows:
```sql
DELETE FROM tab_name
WHERE <condition>
```

In [5]:
%%sql
DELETE FROM Indian_all_2021
WHERE GENDER LIKE 'A%' 
AND AGE LIKE 'A%';

DELETE FROM Indian_male_2021
WHERE AGE LIKE 'A%';

DELETE FROM Indian_female_2021
WHERE AGE LIKE 'A%';

 * sqlite:///testdatabase.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

### c. Sort all the rows within the table:
```sql
SELECT *
FROM table_name
ORDER BY col1 ASC, col2 DESC,...
```
- We can sort the table rows bases on a single or multiple columns.
- `ASC` represents ascending order
- `DESC` represents descending order

In [6]:
%%sql
SELECT *
FROM Indian_all_2021
ORDER BY VALUE ASC

 * sqlite:///testdatabase.db
Done.

[(2021, 'Indians', 'All genders', '90 Years & Over', 1255),
 (2021, 'Indians', 'All genders', '85 - 89 Years', 1905),
 (2021, 'Indians', 'All genders', '85 Years & Over', 3160),
 (2021, 'Indians', 'All genders', '80 - 84 Years', 3289),
 (2021, 'Indians', 'All genders', '75 - 79 Years', 4211),
 (2021, 'Indians', 'All genders', '80 Years & Over', 6449),
 (2021, 'Indians', 'All genders', '70 - 74 Years', 10170),
 (2021, 'Indians', 'All genders', '75 Years & Over', 10660),
 (2021, 'Indians', 'All genders', '0 - 4 Years', 12296),
 (2021, 'Indians', 'All genders', '5 - 9 Years', 13175),
 (2021, 'Indians', 'All genders', '65 - 69 Years', 14059),
 (2021, 'Indians', 'All genders', '10 - 14 Years', 14964),
 (2021, 'Indians', 'All genders', '40 - 44 Years', 16133),
 (2021, 'Indians', 'All genders', '35 - 39 Years', 16778),
 (2021, 'Indians', 'All genders', '15 - 19 Years', 17096),
 (2021, 'Indians', 'All genders', '45 - 49 Years', 17818),
 (2021, 'Indians', 'All genders', '30 - 34 Years', 18580),
 (2021, 'Indians', 'All genders', '60 - 64 Years', 18867),
 (2021, 'Indians', 'All genders', '20 - 24 Years', 18891),
 (2021, 'Indians', 'All genders', '50 - 54 Years', 19290),
 (2021, 'Indians', 'All genders', '25 - 29 Years', 19448),
 (2021, 'Indians', 'All genders', '55 - 59 Years', 20736),
 (2021, 'Indians', 'All genders', '70 Years & Over', 20830),
 (2021, 'Indians', 'All genders', '65 Years & Over', 34889)]

### d. Find the average value of all age groups:

In [7]:
%%sql
SELECT AVG(VALUE) AS average
FROM Indian_all_2021

 * sqlite:///testdatabase.db
Done.

[(13956.208333333334,)]

### e. Filter out age groups that have value smaller than the average:

In [8]:
%%sql
SELECT AGE AS below_average
FROM Indian_all_2021
WHERE VALUE < (
    SELECT AVG(VALUE)
    FROM Indian_all_2021)

 * sqlite:///testdatabase.db
Done.

[('0 - 4 Years',),
 ('5 - 9 Years',),
 ('70 - 74 Years',),
 ('75 - 79 Years',),
 ('75 Years & Over',),
 ('80 - 84 Years',),
 ('80 Years & Over',),
 ('85 - 89 Years',),
 ('85 Years & Over',),
 ('90 Years & Over',)]

In [9]:
%%sql
SELECT AGE AS above_average
FROM Indian_all_2021
WHERE VALUE > (
    SELECT AVG(VALUE)
    FROM Indian_all_2021)

 * sqlite:///testdatabase.db
Done.

[('10 - 14 Years',),
 ('15 - 19 Years',),
 ('20 - 24 Years',),
 ('25 - 29 Years',),
 ('30 - 34 Years',),
 ('35 - 39 Years',),
 ('40 - 44 Years',),
 ('45 - 49 Years',),
 ('50 - 54 Years',),
 ('55 - 59 Years',),
 ('60 - 64 Years',),
 ('65 - 69 Years',),
 ('65 Years & Over',),
 ('70 Years & Over',)]

### g. Find the min and max numbers of the value range.

In [10]:
%%sql
SELECT MAX(VALUE) AS max, MIN(VALUE) AS min
FROM Indian_all_2021

 * sqlite:///testdatabase.db
Done.

[(34889, 1255)]

### h. Call out the age groups associated to the min and max numbers of the value range

In [11]:
%%sql
SELECT AGE AS SMALLEST_GROUP, VALUE
FROM Indian_all_2021 
WHERE VALUE = (SELECT MIN(VALUE)
    FROM Indian_all_2021
              )

 * sqlite:///testdatabase.db
Done.

[('90 Years & Over', 1255)]

In [12]:
%%sql
SELECT AGE AS BIGGEST_GROUP, VALUE
FROM Indian_all_2021 
WHERE VALUE = (SELECT MAX(VALUE)
    FROM Indian_all_2021
              )

 * sqlite:///testdatabase.db
Done.

[('65 Years & Over', 34889)]